use utf8;
%D;
open(F,"<sq.txt") or die "NO!";
$To=0;
while(<F>){if($_=~/([A-Z]{4}) (\d+)/){$To+=$2; $D{$1}=$2}}
$Tx="ΨφΔξβΨμλΓΛΡΘξΡΛξΠμφ";#λΨξΘΓΠμΓΔΨξΛφζΡμλΓΔξΛφζΡμλΓΔξΛφζΡμλΓΔξΨφΔξΡΛξμηφΔΨξΔΡξμΨλΓΘξαΓΔΡΩΓΘξΣΡΔξΡΩξλμΨΩΨξΓξΛΓξΩΨζΛΡξφΠηΓΛΔΓΔξΦΓξΘηξλμΨΩΨξΔφΠΩφΘφβΨξΓζμφΡμΨΩξΛΓΘξΞμΨΣφΩαφΓΘξηΩφΔΓΘξΔΡΛξΘηΔξΦξΛΨΘξΛφζμΡΘξΔΡΛξβηΩΔΨξμΡΘΞΨΩΔΡΩξΓΛξΠμΓΩξΞηΡζΛΨξΓμΠΡΩλφΩΨξΘΓΛηΔξΓΛξΠμΓΩξΞηΡζΛΨξΓμΠΡΩλφΩΨξΘΓΛηΔξΦξΛΨΘξΛφζμΡΘξΔΡΛξβηΩΔΨξμΡΘΞΨΩΔΡΩξΓΛξΠμΓΩξΞηΡζΛΨξΓμΠΡΩλφΩΨξΘΓΛηΔξΦξΛΨΘξΛφζμΡΘξΔΡΛξβηΩΔΨξμΡΘΞΨΩΔΡΩξΓΛξΠμΓΩξΞηΡζΛΨξΓμΠΡΩλφΩΨξΘΓΛηΔξαΨμΨξΘΡΓΩξΡλΡμΩΨΘξΛΨΘξΛΓημΡΛΡΘξϑηΡξΘηΞφβΨΘξαΨΩΘΡΠηφμξϑηΡξΘηΞφβΨΘξαΨΩΘΡΠηφμξαΨμΨΩΓΔΨΘξΔΡξΠΛΨμφΓξΣφΣΓβΨΘξΨξεημΡβΨΘξαΨΩξΠΛΨμφΓξβΨμφμξΨξεημΡβΨΘξαΨΩξΠΛΨμφΓξβΨμφμξΨξεημΡβΨΘξαΨΩξΠΛΨμφΓξβΨμφμ";
$A="ΨφΔξβμλΓΛΡΘΠζηαΩΣΦΞϑε";
@N=();
for($i=0;$i<length($Tx);$i++){push(@N,index($A,substr($Tx,$i,1)))}
@A=qw'A B C D E F G H I J K L M N O P Q R S T U V W X Y Z';
# @A=qw'I U D A F S M E L O C P B R V N J H T Y G Q W X K Z';
sub ic{
    my @M;
    my %C;
    my $ic=0;
    for(my $i=0;$i<=$#N;$i++){$C[$N[$i]]++}
    for(my $i=0;$i<=$#N;$i+=$_[0]){$ic+=$C[$N[$i]]*($C[$N[$i]]-1)/($#N*$#N+1)}
    return $ic;
}
sub fitness{
    my $su=0;
    for(my $i=0;$i<=$#N-4;$i++){
	my $st="";
	for(my $j=0;$j<4;$j++){$st.=$A[$N[$i+$j]]}
	$su+=$D{$st}?log($D{$st}/$To):-10000;
    }
    return $su;
}
sub swap{
    $te=$A[$_[0]];
    $A[$_[0]]=$A[$_[1]];
    $A[$_[1]]=$te;
}
sub decode{for($i=0;$i<$#N;$i++){print($A[$N[$i]])}}
# for($i=0;$i<=$#A;$i++){
#     for($j=$i;$j<=$#A;$j++){
# 	$f=fitness();
# 	swap($i,$j);
# 	if(fitness()<=$f){swap($i,$j)}else{
# 	    print(fitness());
# 	    print(" @A\n");
# 	    $i=0;
# 	}
#     }
# }
# decode();
for($i=1; $i<=10; $i++){print(ic($i)."\n")};
