use utf8;
%D; @N=(); $To=0;

open(F,"<sq.txt");
while(<F>){if($_=~/([A-Z]{4}) (\d+)/){$To+=$2; $D{$1}=$2}}
close(F);

$Tx="ΨφΔξβΨμλΓΛΡΘξΡΛξΠμφλΨξΘΓΠμΓΔΨξΛφζΡμλΓΔξΛφζΡμλΓΔξΛφζΡμλΓΔξΨφΔξΡΛξμηφΔΨξΔΡξμΨλΓΘξαΓΔΡΩΓΘξΣΡΔξΡΩξλμΨΩΨξΓξΛΓξΩΨζΛΡξφΠηΓΛΔΓΔξΦΓξΘηξλμΨΩΨξΔφΠΩφΘφβΨξΓζμφΡμΨΩξΛΓΘξΞμΨΣφΩαφΓΘξηΩφΔΓΘξΔΡΛξΘηΔξΦξΛΨΘξΛφζμΡΘξΔΡΛξβηΩΔΨξμΡΘΞΨΩΔΡΩξΓΛξΠμΓΩξΞηΡζΛΨξΓμΠΡΩλφΩΨξΘΓΛηΔξΓΛξΠμΓΩξΞηΡζΛΨξΓμΠΡΩλφΩΨξΘΓΛηΔξΦξΛΨΘξΛφζμΡΘξΔΡΛξβηΩΔΨξμΡΘΞΨΩΔΡΩξΓΛξΠμΓΩξΞηΡζΛΨξΓμΠΡΩλφΩΨξΘΓΛηΔξΦξΛΨΘξΛφζμΡΘξΔΡΛξβηΩΔΨξμΡΘΞΨΩΔΡΩξΓΛξΠμΓΩξΞηΡζΛΨξΓμΠΡΩλφΩΨξΘΓΛηΔξαΨμΨξΘΡΓΩξΡλΡμΩΨΘξΛΨΘξΛΓημΡΛΡΘξϑηΡξΘηΞφβΨΘξαΨΩΘΡΠηφμξϑηΡξΘηΞφβΨΘξαΨΩΘΡΠηφμξαΨμΨΩΓΔΨΘξΔΡξΠΛΨμφΓξΣφΣΓβΨΘξΨξεημΡβΨΘξαΨΩξΠΛΨμφΓξβΨμφμξΨξεημΡβΨΘξαΨΩξΠΛΨμφΓξβΨμφμξΨξεημΡβΨΘξαΨΩξΠΛΨμφΓξβΨμφμ";
$Alph="ΨφΔξβμλΓΛΡΘΠζηαΩΣΦΞϑε";
for my $i(0..length($Tx)-1){push(@N,index($Alph,substr($Tx,$i,1)))}

@A=qw(A B C D E F G H I J K L M N O P Q R S T U V W X Y Z #);

sub fitness{
    my $su=0;
    my @M=grep{$A[$_] ne '#'}@N;
    for my $i(0..$#M-2){
	my $st=join('',map{$A[$_]}@M[$i..$i+3]);
	$su+=$D{$st}?log($D{$st}/$To):log(0.01/$To);
    }
    return $su;
}

sub swap{for my $i(0..scalar(@_)-2){@A[$_[$i],$_[$i+1]]=@A[$_[$i+1],$_[$i]]}}

sub randomize{for(0..$#A){swap($_,int(rand($#A+1)))}}

sub decode{
    for(my $i=0;$i<=$#A;$i++){
	for(my $j=$i+1;$j<=$#A;$j++){
	    for(my $k=$j;$k<=$#A;$k++){
		my $f0=fitness();
		my @B=@A;
		swap($i,$j,$k);
		if(fitness()<=$f0){@A=@B}else{
		    $i=-1;
		    $j=$k=$#A;
		    print("@A ",fitness(),"\n");
		}
	    }
	}
    }
}

randomize();
decode();
print(map{$A[$_] eq '#'?' ':$A[$_]}@N);
